mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
/***********************************************************************************************//**
 * Copyright 2021 Mario Kodba
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 ***************************************************************************************************
 * @file    bsp_mpu9150.c
 * @author  mario.kodba
 * @brief   MPU9150 MEMS source file.
 **************************************************************************************************/


/***************************************************************************************************
 *                              INCLUDE FILES
 **************************************************************************************************/
#include <stddef.h>

#include "bsp_mpu9150.h"
#include "nrf_delay.h"
#include "nrf_drv_twi.h"

/***************************************************************************************************
 *                              DEFINES
 **************************************************************************************************/
#define BSP_MPU9150_WRITE_BYTE                  (0b11010000u)   //!< MPU-9150 I2C write byte
#define BSP_MPU9150_READ_BYTE                   (0b11010001u)   //!< MPU-9150 I2C read byte

#define BSP_MPU9150_TWI_TIMEOUT                 (10000u)        //!< I2C transfer timeout value
#define BSP_MPU9150_SINGLE_REG_MSG_SIZE         (2u)            //!< I2C message size for single register

#define BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT (32767.f)       //!< Max positive value for signed 16-bit (floating point)
#define BSP_MPU9150_16_BIT_SIGNED_MAX_VAL       (32767)         //!< Max positive value for signed 16-bit

#define BSP_MPU9150_TEMP_CONVERSION_CONST_1     (340)           //!< First constant for temperature conversion (datasheet)
#define BSP_MPU9150_TEMP_CONVERSION_CONST_2     (35)            //!< Second constant for temperature conversion (datasheet)

#define BSP_MPU9150_GYRO_RANGE_250DEG_CONST     (250.f)         //!< Constant for multiplication in gyro range +-250deg/s
#define BSP_MPU9150_GYRO_RANGE_500DEG_CONST     (500.f)         //!< Constant for multiplication in gyro range +-500deg/s
#define BSP_MPU9150_GYRO_RANGE_1000DEG_CONST    (1000.f)        //!< Constant for multiplication in gyro range +-1000deg/s
#define BSP_MPU9150_GYRO_RANGE_2000DEG_CONST    (2000.f)        //!< Constant for multiplication in gyro range +-2000deg/s

#define BSP_MPU9150_ACC_RANGE_2G_CONST          (2.f)           //!< Constant for multiplication in acc range +-2G
#define BSP_MPU9150_ACC_RANGE_4G_CONST          (4.f)           //!< Constant for multiplication in acc range +-4G
#define BSP_MPU9150_ACC_RANGE_8G_CONST          (8.f)           //!< Constant for multiplication in acc range +-8G
#define BSP_MPU9150_ACC_RANGE_16G_CONST         (16.f)          //!< Constant for multiplication in acc range +-16G

// pre-defined register values to send
#define BSP_MPU9150_RESET_SIGNAL_PATH_VALUE     (0x7u)          //!< Value to send in order to reset signal paths
#define BSP_MPU9150_PLL_REFERENCE_VALUE         (0x1u)          //!< Value to send to set PLL reference as X Gyroscope
#define BSP_MPU9150_DEVICE_ID_VALUE             (0b01101000u)   //!< Device ID that will verify correct device operation


/***************************************************************************************************
 *                          GLOBAL VARIABLES
 **************************************************************************************************/
static volatile bool twi_tx_done = false;
static volatile bool twi_rx_done = false;

/***************************************************************************************************
 *                          PRIVATE FUNCTION DECLARATIONS
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_waitRxTransferFinish(BSP_MPU9150_err_E *outErr);
__INLINE static void BSP_MPU9150_waitTxTransferFinish(BSP_MPU9150_err_E *outErr);
static void BSP_MPU9150_writeSingleReg(BSP_MPU9150_device_S *inDevice,
        const uint8_t regAddr,
        const uint8_t regData,
        BSP_MPU9150_err_E *outErr);
static void BSP_MPU9150_readSingleReg(BSP_MPU9150_device_S *inDevice,
        const uint8_t regAddr,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr);
//static void BSP_MPU9150_readMultiReg(BSP_MPU9150_device_S *inDevice,
//        const uint8_t startRegAddr,
//        const uint8_t length,
//        uint8_t *data,
//        BSP_MPU9150_err_E *outErr);
static void BSP_MPU9150_configuration(BSP_MPU9150_device_S *inDevice, BSP_MPU9150_err_E *outErr);

/***************************************************************************************************
 *                          PUBLIC FUNCTION DEFINITIONS
 **************************************************************************************************/
/***********************************************************************************************//**
 * @brief Function initializes MEMS MPU-9150 component.
 ***************************************************************************************************
 * @param [in]  *inDevice - pointer to device structure for MPU-9150 driver.
 * @param [in]  *inConfig - configuration structure for MPU-9150 driver.
 * @param [out] *outErr   - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
void BSP_MPU9150_init(BSP_MPU9150_device_S *inDevice,
        BSP_MPU9150_config_S *inConfig,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    uint8_t deviceId = 0u;

    if((inDevice != NULL) && (inConfig != NULL)) {
        inDevice->config = inConfig;

        // verify device ID by reading register value
        BSP_MPU9150_readSingleReg(inDevice,
                BSP_MPU9150_REG_WHO_AM_I,
                &deviceId,
                &err);

