mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
        // reset signal path for gyroscope, accelerometer and temperature sensor
        BSP_MPU9150_writeSingleReg(inDevice,
                BSP_MPU9150_REG_SIGNAL_PATH_RESET,
                BSP_MPU9150_RESET_SIGNAL_PATH_VALUE,
                &err);
        nrf_delay_ms(30u);

        if(err == BSP_MPU9150_err_NONE) {
            // set PLL with X axis gyroscope reference (for better clock stability)
            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_PWR_MGMT_1,
                    BSP_MPU9150_PLL_REFERENCE_VALUE,
                    &err);
            // wait 1ms for PLL to settle (datasheet)
            nrf_delay_ms(1u);
        }

        // verify device ID by reading register value
        BSP_MPU9150_readSingleReg(inDevice,
                BSP_MPU9150_REG_WHO_AM_I,
                &deviceId,
                &err);

        if(err == BSP_MPU9150_err_NONE) {
            if(deviceId != BSP_MPU9150_DEVICE_ID_VALUE) {
                // device ID value read is not correct
                err = BSP_MPU9150_err_INIT;
            }
        }

        // configure sensors before start of sampling
        if(err == BSP_MPU9150_err_NONE) {
            BSP_MPU9150_configuration(inDevice, &err);
        }
        // TODO: check if this is needed at all
        nrf_delay_ms(50u);

        if(err == BSP_MPU9150_err_NONE) {
            inDevice->isInitialized = true;
        }
    }

    if(outErr != NULL) {
        *outErr = err;
    }
}

void nrf_drv_mpu_twi_event_handler(nrf_drv_twi_evt_t const * p_event, void * p_context) {

    switch(p_event->type) {
        case NRF_DRV_TWI_EVT_DONE:
            switch(p_event->xfer_desc.type) {
                case NRF_DRV_TWI_XFER_TX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXTX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_RX:
                    twi_rx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXRX:
                    twi_rx_done = true;
                    break;
                default:
                    break;
            }
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            break;
        default:
            break;
    }
}

/***************************************************************************************************
 *                          PRIVATE FUNCTION DEFINITIONS
 **************************************************************************************************/
/***********************************************************************************************//**
 * @brief Function for writing to single register of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  regData      - data to be sent.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_writeSingleReg(BSP_MPU9150_device_S *inDevice,
        const uint8_t regAddr,
        const uint8_t regData,
        BSP_MPU9150_err_E *outErr) {

    uint32_t err_code;
    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;

    // assemble I2C data - 1 byte register address, 1 byte data
    uint8_t msg[BSP_MPU9150_SINGLE_REG_MSG_SIZE] = { regAddr, regData };

    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &msg[0],
            BSP_MPU9150_SINGLE_REG_MSG_SIZE,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }

    twi_tx_done = false;

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from single register of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_readSingleReg(BSP_MPU9150_device_S *inDevice,
        const uint8_t regAddr,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    uint32_t err_code;
    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;

    // after first START condition send |SLAVE_ADDR+W|REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &regAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_tx_done = false;

    // after second START condition read in data from register
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            data,
            1u);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_rx_done = false;

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from multiple successive registers of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param [in]  startRegAddr - starting register address.
 * @param [in]  length       - number of registers (bytes) to read.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
void BSP_MPU9150_readMultiReg(BSP_MPU9150_device_S *inDevice,
        const uint8_t startRegAddr,
        const uint8_t length,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    uint32_t err_code;
    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;

    // after first START condition send |SLAVE_ADDR+W|START_REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &startRegAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_tx_done = false;

    // after second START condition read in data from registers
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            data,
            length);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_rx_done = false;

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function calculates temperature value in degrees using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in] rawValue     -   pointer to raw temperature value, read from register.
 * @return Temperature value in degree celsius.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
int16_t BSP_MPU9150_calculateTemperature(const uint8_t *rawValue) {

    int16_t retVal = 0;

    if(rawValue != NULL) {
        retVal = rawValue[1] + (rawValue[0] << 8u);
        retVal = retVal / BSP_MPU9150_TEMP_CONVERSION_CONST_1 + BSP_MPU9150_TEMP_CONVERSION_CONST_2;
    }

    return retVal;
}

/***********************************************************************************************//**
 * @brief Function calculates gyroscope value using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param  [in]  *rawValue    - pointer to raw gyroscope measurements, read from register in bytes.
 * @param  [out] *outGyro     - pointer to calculated gyroscope values in degree/seconds.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
void BSP_MPU9150_calculateGyroValues(const BSP_MPU9150_device_S *inDevice,
        const uint8_t *rawValue,
        int16_t *outGyro) {

    int16_t gyroX = 0;
    int16_t gyroY = 0;
    int16_t gyroZ = 0;

    float floatGyroX = 0.f;
    float floatGyroY = 0.f;
    float floatGyroZ = 0.f;

    if((inDevice != NULL) && (rawValue != NULL) && (outGyro != NULL)) {
        gyroX = rawValue[1] + (rawValue[0] << 8u);
        gyroY = rawValue[3] + (rawValue[2] << 8u);
        gyroZ = rawValue[5] + (rawValue[4] << 8u);

