mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
        // this will give the real (interpreted) value in degree/seconds
        switch(inDevice->config->gyroRange) {
            default:
            case BSP_MPU9150_gyroFsRange_250degS:
                floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
                floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
                floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
                break;
            case BSP_MPU9150_gyroFsRange_500degS:
                floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
                floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
                floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
                break;
            case BSP_MPU9150_gyroFsRange_1000degS:
                floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
                floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
                floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
                break;
            case BSP_MPU9150_gyroFsRange_2000degS:
                floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
                floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
                floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
                break;
        }

        // output it as 16-bit values
        gyroX = (int16_t) floatGyroX;
        gyroY = (int16_t) floatGyroY;
        gyroZ = (int16_t) floatGyroZ;

        // X-axis Gyro
        outGyro[0] = gyroX;
        // Y-axis Gyro
        outGyro[1] = gyroY;
        // Z-axis Gyro
        outGyro[2] = gyroZ;
    }
}

/***********************************************************************************************//**
 * @brief Function calculates accelerometer value using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param  [in]  *rawValue    - pointer to raw gyroscope measurements, read from register in bytes.
 * @param  [out] *outAcc      - pointer to calculated accelerometer values in G.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
void BSP_MPU9150_calculateAccValues(const BSP_MPU9150_device_S *inDevice,
        const uint8_t *rawValue,
        int16_t *outAcc) {

    int16_t accX = 0;
    int16_t accY = 0;
    int16_t accZ = 0;

    float floatAccX = 0.f;
    float floatAccY = 0.f;
    float floatAccZ = 0.f;

    if((inDevice != NULL) && (rawValue != NULL) && (outAcc != NULL)) {
        accX = rawValue[1] + (rawValue[0] << 8u);
        accY = rawValue[3] + (rawValue[2] << 8u);
        accZ = rawValue[5] + (rawValue[4] << 8u);

        // this will give the real (interpreted) value in G
        switch(inDevice->config->accRange) {
            default:
            case BSP_MPU9150_accFsRange_2G:
                floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
                floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
                floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
                break;
            case BSP_MPU9150_accFsRange_4G:
                floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
                floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
                floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
                break;
            case BSP_MPU9150_accFsRange_8G:
                floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
                floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
                floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
                break;
            case BSP_MPU9150_accFsRange_16G:
                floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
                floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
                floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
                break;
        }

        // output values in mG, that way they can be stored as 16-bit
        accX = (int16_t) (floatAccX * 1000);
        accY = (int16_t) (floatAccY * 1000);
        accZ = (int16_t) (floatAccZ * 1000);

        // X-axis Accelerometer
        outAcc[0] = accX;
        // Y-axis Accelerometer
        outAcc[1] = accY;
        // Z-axis Accelerometer
        outAcc[2] = accZ;
    }
}

/***********************************************************************************************//**
 * @brief Function waits (blocking) for I2C RX transfer finish or timeout.
 ***************************************************************************************************
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_waitRxTransferFinish(BSP_MPU9150_err_E *outErr) {

    uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        *outErr = BSP_MPU9150_err_I2C_TIMEOUT;
    }
}

/***********************************************************************************************//**
 * @brief Function waits (blocking) for I2C TX transfer finish or timeout.
 ***************************************************************************************************
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_waitTxTransferFinish(BSP_MPU9150_err_E *outErr) {

    uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        *outErr = BSP_MPU9150_err_I2C_TIMEOUT;
    }
}

/***********************************************************************************************//**
 * @brief Function sets up configuration registers for MPU-9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    16.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_configuration(BSP_MPU9150_device_S *inDevice, BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    BSP_MPU9150_configReg_U configRegVal = { .R = 0u };
    BSP_MPU9150_gyroConfigReg_U gyroConfigReg = { .R = 0u };
    BSP_MPU9150_accConfigReg_U accConfigReg = { .R = 0u };
    BSP_MPU9150_intConfigReg_U intConfigReg = { .R = 0u };
    BSP_MPU9150_intEnableReg_U intEnableReg = { .R = 0u };

    if(inDevice != NULL) {
        /*
         * Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV), where Gyroscope Output Rate
         * can be either 8kHz when DLPF is disabled, or 1kHz when DLPF is enabled
         */
        uint8_t samplingRateRegVal = 9u;
        BSP_MPU9150_writeSingleReg(inDevice,
                BSP_MPU9150_REG_SMPLRT_DIV,
                samplingRateRegVal,
                &err);

