mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
        /*
         * Configuration register sets up DLPF and sampling of External FSYNC pin
         */
        if(err == BSP_MPU9150_err_NONE ) {
            // enables/disables DLPF
            configRegVal.B.dlpfCfg = true;
            configRegVal.B.extSyncSet = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_CONFIG,
                    configRegVal.R,
                    &err);
        }

        /*
         * Interrupt configuration sets up interrupt behavior
         */
        if(err == BSP_MPU9150_err_NONE ) {
            intConfigReg.B.fsyncIntEn = false;
            intConfigReg.B.fsyncIntLevel = false;
            intConfigReg.B.i2cBypassEn = false;
            intConfigReg.B.intLevel = false;
            intConfigReg.B.intOpen = false;
            intConfigReg.B.intRdClear = false;
            intConfigReg.B.latchIntEn = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_INT_PIN_CFG,
                    intConfigReg.R,
                    &err);
        }

        /*
         * Setup gyroscope configuration
         */
        if(err == BSP_MPU9150_err_NONE ) {
            gyroConfigReg.B.fsSel = (uint8_t) inDevice->config->gyroRange;
            gyroConfigReg.B.xg_st = false;
            gyroConfigReg.B.yg_st = false;
            gyroConfigReg.B.zg_st = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_GYRO_CONFIG,
                    gyroConfigReg.R,
                    &err);
        }

        /*
         * Setup accelerometer configuration
         */
        if(err == BSP_MPU9150_err_NONE ) {
            accConfigReg.B.afsSel = (uint8_t) inDevice->config->accRange;
            accConfigReg.B.xa_st = false;
            accConfigReg.B.ya_st = false;
            accConfigReg.B.za_st = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_ACCEL_CONFIG,
                    accConfigReg.R,
                    &err);
        }

        /*
         * Interrupt enable setup
         */
        if(err == BSP_MPU9150_err_NONE ) {
            intEnableReg.B.i2cMstIntEn = false;
            intEnableReg.B.fifoOverflowEn = false;
            intEnableReg.B.dataRdyEn = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_INT_ENABLE,
                    intEnableReg.R,
                    &err);
        }
    }

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***************************************************************************************************
 *                          END OF FILE
 **************************************************************************************************/
